<h1><center>Encoding</center></h1>

**1-Importing Essential Libraries**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.impute import SimpleImputer

_2- reading .csv file._

In [2]:
data=pd.read_csv('m.csv')

_3- looking at first five row of dataset._

In [3]:
data.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

_4- descriptive statistics of dataset._

In [4]:
data.describe().T

        count     mean           std  ...      50%      75%      max
Age      10.0     38.5      7.306770  ...     37.5     43.0     50.0
Salary   10.0  63900.0  11570.556503  ...  63000.0  70750.0  83000.0

[2 rows x 8 columns]

_5- counting total number of null values in each attributes of dataset._

In [5]:
data.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

_6- using mean strategy to impute the missing values with SimpleImputer class._

In [6]:
imputer=SimpleImputer(missing_values=np.NaN)
imp = imputer.fit(data.iloc[:, 1:3])
data.iloc[:, 1:3] = imp.transform(data.iloc[:, 1:3])
data.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0  63900.0       Yes

_7- final dataset with no missing values_

In [7]:
data.isnull().sum()

Country      0
Age          0
Salary       0
Purchased    0
dtype: int64

**label Encoding**

In [8]:
from sklearn import preprocessing 
encoder = preprocessing.LabelEncoder() 
data["Purchased"]= encoder.fit_transform(data["Purchased"]) 
data.head()

   Country   Age   Salary  Purchased
0   France  44.0  72000.0          0
1    Spain  27.0  48000.0          1
2  Germany  30.0  54000.0          0
3    Spain  38.0  61000.0          0
4  Germany  40.0  63900.0          1

**One Hot Encoding**

In [9]:
country=data[['Country']].values
from sklearn.preprocessing import OneHotEncoder
encoder = OneHotEncoder()
country=encoder.fit_transform(country).toarray()
country=pd.DataFrame(country)
country_columns=['France', 'Germany', 'India', 'Spain']
country.columns=country_columns
data.drop(['Country'],axis=1,inplace=True)
final_df=country.join(data)
final_df

    France  Germany  India  Spain   Age   Salary  Purchased
0      1.0      0.0    0.0    0.0  44.0  72000.0          0
1      0.0      0.0    0.0    1.0  27.0  48000.0          1
2      0.0      1.0    0.0    0.0  30.0  54000.0          0
3      0.0      0.0    0.0    1.0  38.0  61000.0          0
4      0.0      1.0    0.0    0.0  40.0  63900.0          1
5      1.0      0.0    0.0    0.0  35.0  58000.0          1
6      0.0      0.0    0.0    1.0  38.5  52000.0          0
7      1.0      0.0    0.0    0.0  48.0  79000.0          1
8      0.0      1.0    0.0    0.0  50.0  83000.0          0
9      1.0      0.0    0.0    0.0  37.0  67000.0          1
10     0.0      0.0    1.0    0.0  36.0  65000.0          1